In [1]:
# Name: Chaithra Kopparam Cheluvaiah
# Nov 28, 2021

# PANDAS - MISSING DATA

A lot of times when we're using pandas to read in data if we have a missing points what's going to happen is Pandas will automatically fill in that missing point with null/nan value.

- dropna() - drop row/column
- fillna() - some value and by mean of the column

In [3]:
import numpy as np
import pandas as pd

In [7]:
# just like we create series from dictionary, we can create data frames as well.
d = {'A':[1,2,np.nan],'B':[5,np.nan,np.nan],'C':[1,2,3]} # keys will be the column names and value (list) will be data points 
# for that column

In [6]:
df = pd.DataFrame(d)
df

     A    B  C
0  1.0  5.0  1
1  2.0  NaN  2
2  NaN  NaN  3

### DROPPING MISSING VALUES

In [8]:
df.dropna() # drop all the rows that are having atleast one nan

     A    B  C
0  1.0  5.0  1

In [9]:
df.dropna(axis=1) # to perform drop column-wise

   C
0  1
1  2
2  3

In [10]:
# we can also specify threshold
df.dropna(thresh=2) # drop row-wise 

# thresh- Require that many non-NA values to be dropped

     A    B  C
0  1.0  5.0  1
1  2.0  NaN  2

### REPLACING MISSING VALUES

In [14]:
df.fillna(value='test')

      A     B  C
0   1.0   5.0  1
1   2.0  test  2
2  test  test  3

In [15]:
# Lot of times, we might want to fill in the mean of the column
df.fillna(value = df['A'].mean())

     A    B  C
0  1.0  5.0  1
1  2.0  1.5  2
2  1.5  1.5  3